mapping center_yi_name_list = ([
    "少林派":"明镜止水",
    "武当派":"无极道心",
    "峨嵋派":"青莲剑意",
    "华山派":"苍松之劲",
    "丐帮":"龙战于野",
    "桃花岛":"飞花落叶",
    "星宿派":"天罡星辰",
    "逍遥派":"自由自在",
    "古墓派":"黯然隐雾",
    "全真教":"金丹秘要",
    "神龙教":"神龙降世",
    "密宗":"梵音破魔",
    "雪山寺":"雪域圣光",
    "血刀门":"血海翻腾",
    "灵鹫宫":"灵鹫飞羽",
    "欧阳世家":"狂风扫落叶",
    "关外胡家":"胡马嘶风",
    "慕容世家":"紫燕穿云",
    "段氏皇族":"段氏神悟",
    "明教":"光明圣火",
    "日月神教":"日月无光",
    "华山剑宗":"苍松之劲",
]);

// 将mapping的key和value互换
mapping center_yi_family_name_list = ([
    "明镜止水":"少林派",
    "无极道心":"武当派",
    "青莲剑意":"峨嵋派",
    "苍松之劲":"华山派",
    "龙战于野":"丐帮",
    "飞花落叶":"桃花岛",
    "天罡星辰":"星宿派",
    "自由自在":"逍遥派",
    "黯然隐雾":"古墓派",
    "金丹秘要":"全真教",
    "神龙降世":"神龙教",
    "梵音破魔":"密宗",
    "雪域圣光":"雪山派",
    "血海翻腾":"血刀门",
    "灵鹫飞羽":"灵鹫宫",
    "狂风扫落叶":"欧阳世家",
    "胡马嘶风":"关外胡家",
    "紫燕穿云":"慕容世家",
    "段氏神悟":"段氏皇族",
    "光明圣火":"明教",
    "日月无光":"日月神教",
    "苍松之劲":"华山剑宗",
]);


int lingwu(object me,string family_name)
{
    string yi_name;

    if (!center_yi_name_list[family_name])
    {
        tell_object(me,"出错,没有这个门派的核心意境,以退换潜能50w,请反馈管理员。\n");
        me->add("potential",500000);
        return 1;
    }
    yi_name = center_yi_name_list[family_name];

    if (me->query("skill_aoyi/" + yi_name) >= 9)
    {
        tell_object(me,"你的" + yi_name + "的境界已经领悟到极致了，但你从中仍然领悟到了不少，自身潜能增加50万。\n");
        me->add("potential",500000);
        return 1;
    }

    if (me->query("skill_aoyi/" + yi_name) < 9)
    {
        tell_object(me,"你领悟了" + yi_name + "的核心意境，" + yi_name + "的境界提升了一层。\n");
        me->add("skill_aoyi/" + yi_name,1);
        return 1;
    }

    tell_object(me,"出错,请反馈管理员。\n");
    return 1;
}